/****************************************************************************
 *                                                                          *
 * File    : main.c                                                         *
 *                                                                          *
 * Purpose : Console mode (command line) program.                           *
 *                                                                          *
 * History : Date      Reason                                               *
 *           00/00/00  Created                                              *
 *                                                                          *
 ****************************************************************************/



/****************************************************************************
 *                                                                          *
 * Function: main                                                           *
 *                                                                          *
 * Purpose : Main entry point.                                              *
 *                                                                          *
 * History : Date      Reason                                               *
 *           00/00/00  Created                                              *
 *                                                                          *
 ****************************************************************************/
#include<stdio.h>
int main(void)
{
    int a, b, d, k, n, i;

	for ( a=400; a<=430; a++ )
       {
		printf("\n%d  ", a);  					  //вывод числа от 400 до 430
		k=0;                   		             // колличество делителей, которые есть у числа a
		n=0;
		for (b=2; b<=(a/2); b++)				//вычисление делителей
      {
	   if(a%b==0)							   //остаток от деления a на b

           {
			k++;							  //изменене счетчика на 1, после нахождения нужного числа
			if ( k>=1  && ( (k+3)%4!=0 ) )  // постановка запятых в нужных местах
           {
		     printf(","); }
                           
			printf("%3d", b);				//вывод делителя
		if(k%4==0)

		   printf(",\n     ");
}
}
    
   

/*
             if (k%4!=0) 
			for (i=(k%4); 4; i++) 
				printf("   ");*/


       /*  if(k==0 )                 //вывод колличества делителей
		   printf("%22d", k);
         else if( (k+2)%4==0)
              printf("%15d", k );				  
		 else if ( (k+3)%4==0)
              printf("%19d", k); 
		 else if (k%4==0)
			   printf("%5d", k);


		// правый символ на расстоянии 22 пробелов от а*/
		
}
	printf("\n");

    return 0;













}

