/****************************************************************************
 *                                                                          *
 * File    : main.c                                                         *
 *                                                                          *
 * Purpose : Console mode (command line) program.                           *
 *                                                                          *
 * History : Date      Reason                                               *
 *           00/00/00  Created                                              *
 *                                                                          *
 ****************************************************************************/

#include <stdio.h>

/****************************************************************************
 *                                                                          *
 * Function: main                                                           *
 *                                                                          *
 * Purpose : Main entry point.                                              *
 *                                                                          *
 * History : Date      Reason                                               *
 *           00/00/00  Created                                              *
 *                                                                          *
 ****************************************************************************/

#include <stdio.h>

int main(void)
{
    int k, m, a, b;

	for ( a = 400; a <= 430; a++ )
    {
		printf("%d  ", a);                                  //вывод числа от 400 до 430
		k = 0;                                              //колличество делителей, которые есть у числа a
		m=0;
		for (  b = 2; b <= a / 2; b++ )                  //вычисление делителей
        {
            if ( a % b == 0 )                               //остаток от деления a на b = 0, значит b - делитель
            {
                if ( k > 0 && ( k % 4 == 0 ) )              //разбивка вывода по 4 делителя в строке
                    printf(",\n     ");

               k++;                                        //инкрементация счетчика делителей
				
				
                if ( k >= 1  && ( (k + 3) % 4 != 0 ) )      //постановка запятых в нужных местах
                    printf(","); 
                printf("%3d", b);                           //вывод делителя

            }
			
        }
           
        if ( k % 4 != 0 )                                   //заполнение пробелами неполной последней строки
			for ( int i = k % 4; i < 4; i++ ) 
				printf("    ");

        if ( k == 0 )                                       //заполнение пробелами строки, если делителей нет
            printf("               ");

		printf("  %4d\n", k);                               //вывод количества делителей
    }
	   printf("\n");
	    printf("427\n");
				
				
				
		
    return 0;
}
